"""
==================================
文件名: python_basic43
作者:    xiaoliu
时间:   2022/5/8-14:23
==================================
"""
"""
while 循环


语法：
while 条件：
    语句块

当条件成立时执行语句块
"""
# 循环案例1：打印1-100
i = 1
while i <= 100:
    print(i)  # 打印i    动作1：第一次循环判断 1<=100 打印了1  第二次循环判断 2<=100 打印了2……打印100
    i += 1  # i = i + 1  动作2：每一次循环都会给i加1（每次自增1）

# 循环案例2：打印0-100的偶数
# 方式一
i = 0
while i <= 100:  # i的取值范围 0-100
    if i % 2 == 0:
        print(i)  # 0 2 4 6 ……
    i += 1

# 方式二
i = 0
while i <= 100:
    print(i)
    i += 2

# 求出1-100的偶数的数量
i = 1
count = 0
while i <= 100:
    if i % 2 == 0:
        count += 1
    i += 1
print('偶数的数量为：{}'.format(count))  # 50

# 求出1-2022年闰年的数量
i = 1
count = 0
while i <= 2022:
    if (i % 4 == 0 and i % 100 != 0) or i % 400 == 0:
        count += 1
    i += 1
print('闰年的数量为：' + str(count))  # 490

# 求出1-10的和
i = 1
sum1 = 0
while i <= 10:  # i的取值范围是：1-10
    sum1 += i  # 0+1+2+3……+10
    i += 1
print('1到10的和为：' + str(sum1))  # 1到10的和为：55

# 求出1-100的偶数的和
i = 1
sum1 = 0
while i <= 100:
    if i % 2 == 0:
        sum1 += i
    i += 1
print('1-100偶数的和为：' + str(sum1))  # 1-100偶数的和为：2550

# 求出1-10的阶乘  1*2*3……*10
i = 1
m = 1
while i <= 10:
    m *= i
    i += 1
print(m)  # 3628800
